#!/bin/bash
#
#---------------------------------------------+
#学习笔记 for Linux命令行与shell脚本编程大全.第3版  |
#---------------------------------------------+
#记录者：李谦                                   |
#---------------------------------------------+
#日期:2020.5.12，18:04                         |
#---------------------------------------------+
#Email:59661391@qq.com                        |
#---------------------------------------------+
#Good start                                   |
#---------------------------------------------+
#
################################下面演示多行注释###############################
:<<!
echo "注释"
echo '里面是多行注释'
!
################################多行注释END##################################
echo "+--------------+-----+--------------------+------+--------------+"
echo '| Study Notes  | For | Linux Command Line | And  | Shell Script |'
echo '|--------------+-----+--------------------+------+--------------|'
echo '|--------------------+-----------------------+------------------|'
echo '| Self-learner:LeeQx | Email:59661391@qq.com |  Date:2020.5.13  |'
echo '|--------------------+-----------------------+------------------|'
echo '|---------------------------------------------------------------|'
echo "| You have to believe in yourself. That's the secret of success.|"
echo '+---------------------------------------------------------------+'
echo '人必须相信自己,这是成功的秘诀.(卓别林.C.)'
echo ""
sleep 2
echo ""
echo 'Hello World!'
echo ""
sleep 1
echo ""
echo '-------------------------初识Linux shell--------------------------'
sleep 1
echo ""
echo '          Linux可划分为以下四部分：'
sleep 1
echo ""
echo '                 Linux内核'
echo '                 GNU工具'
echo '                 图形化桌面环境'
echo '                 应用软件'
echo ""
sleep 1
echo "          每一部分在Linux系统中各司其职。但就单个部分而言，其作用并不大。"
echo ""
sleep 1
echo '          图1-1 展示了各部分是如何协作起来构成整个Linux系统的。'
sleep 1
echo '       
      +-------------------------------------+
      |       Application software          |->应用软件
      +-------------------------------------+
      +    ↕      ↕      ↕      ↕      ↕    +
      +-------------------------------------+
      |  Window management software         |->窗口管理软件,包括图形界面GUI和命令行界面CLI(需要确认,自学者注!)
      |                    +----------------+
      |GUI:                |  ↕  ↕  ↕  ↕  ↕
      |Graphical           | +--------------+
      |User                | |              |
      |Interface           | |  GNU tools   |->GNU系统工具链(各种系统命令工具)
      |CLI:command-line    | |              |
      |    interface       | |              |
      +--------------------+ +--------------+
      +    ↕      ↕      ↕      ↕      ↕    +
      +-------------------------------------+
      |            Linux kernel             |->Linux 内核
      +-------------------------------------+
      +    ↕      ↕      ↕      ↕      ↕    +
      +-------------------------------------+
      |          computer hardware          |->计算机硬件
      +-------------------------------------+
                   图1-1 Linux系统'
echo ""
sleep 1
echo '-------------------------深入Linux kernel--------------------------'
echo ""
sleep 1
echo '
      Linux系统的核心是内核。
      内核控制着计算机系统上的所有硬件和软件，在必要时分配硬件，并根据需要执行软件。
     '
echo ""
sleep 1
echo 'Linus Torvalds(林纳斯·托瓦兹)还在赫尔辛基大学上学时就开发了第一版Linux内核。'
echo ""
sleep 1
echo '
      内核主要负责以下四种功能：
      -> 系统内存管理
      -> 软件程序管理
      -> 硬件设备管理
      -> 文件系统管理
      '